export const feedbacks = [
  {
    text: 'صراحة نظام كيتوستايل فرق معاي وقدرت انحف بشهر اكثر من ٨ كيلو بفضل الله ثم بفضل المدرب احمد الراسي.صراحة نظام كيتوستايل فرق معاي وقدرت انحف بشهر اكثر من ٨ كيلو بفضل الله ثم بفضل المدرب احمد الراسي',
    person: 'احمد عبدالرحمن - الرياض'
  },
  {
    text: 'قدرت انحف على نظام الكيتو بطريقة مرا سريعه وسهله وللامانه ماحسيت بأي تعب او ارهاق زي مايقولو والمدربه ماقصرت معاي الصراحه',
    person: 'نوف - جدة '
  },
  {
    text: 'كنت خايف للامانه من موضوع الكيتو لكن مع كيتوستايل فرق الموضوع معاي بشكل كبير نزلت من ١٠٨ ل٩٩ كيلو بشهر ومستمر باذن الله ',
    person: 'سعود الحربي - القصيم'
  },
  {
    text: 'والله والله والله بدون اي مجامله نظام الكيتو بكيتوستايل كان نقطة فارقه بحياتي المدرب احمد كان بقمة الاخلاق معاي وقدرت انزل معاه اكثر من ٤ كيلو اللهم لك الحمد',
    person: 'نواف الملحم - الدمام'
  },
  {
    text: 'الله يسعد المدربه أمل كانت معاي خطوه بخطوه ومكملين معاها باذن الله',
    person: 'ساره - ينبع'
  },
  {
    text: 'انصح الكل يجرب كيتوستايل ماندمت على اي ريال دفعته',
    person: 'جمانه - الرياض'
  }
];
