import {
  Flex,
  Heading,
  Table,
  Text,
  ListItem,
  UnorderedList,
  Thead,
  Tbody,
  Tr,
  Th,
  Td,
  TableContainer
} from '@chakra-ui/react';

export default function TermPolicy() {
  return (
    <>
      <Heading fontSize='md'> (8) سياسة الاشتراك</Heading>
      <Text>
        يحق لنا تحديد قيمة الاشتراكات الخاصة بخدمات الموقع، ونقوم بتحديد قيمة
        الاشتراك لكل خدمة نوفرها، والأسعار التي نوفرها قابلة للتحديث والتعديل،
        وتطبق كافة التعديلات على الاشتراكات الجديدة وتجديد الاشتراكات. وتكون
        باقة الاشتراكات الحالية على النحو الآتي:
      </Text>
      <TableContainer>
        <Table
          w='max-content'
          mx='auto'
          className='term-table'
          variant='unstyled'
        >
          <Thead>
            <Tr>
              <Th>مدة الاشتراك</Th>
              <Th>قيمة الاشتراك</Th>
              <Th>مميزات إضافية</Th>
            </Tr>
          </Thead>
          <Tbody>
            <Tr>
              <Td>شهر واحد</Td>
              <Td>٣٥ ريال سعودي</Td>
              <Td></Td>
            </Tr>
            <Tr>
              <Td>3 شهور</Td>
              <Td>٨٩ ريال سعودي</Td>
              <Td>خدمة التمارين (شهر مجاني)</Td>
            </Tr>
            <Tr>
              <Td>6 شهور s</Td>
              <Td>١٦٩ ريال سعودي</Td>
              <Td>خدمة التمارين (شهر مجاني) + أخصائي التغذية (أسبوع مجاني)</Td>
            </Tr>
          </Tbody>
        </Table>
      </TableContainer>
      <Text>
        ويوفر الموقع خدمات إضافية يمكن للعميل طلبها إلى جانب باقات الاشتراك:
      </Text>
      <TableContainer>
        <Table
          variant='unstyled'
          className='term-table'
          mx='auto'
          maxW='max-content'
        >
          <Thead>
            <Tr>
              <Th>نوع الخدمة</Th>
              <Th>قيمة الاشتراك</Th>
            </Tr>
          </Thead>
          <Tbody>
            <Tr>
              <Td>خدمة أخصائي التغذية</Td>
              <Td>59 ريال شهريًا</Td>
            </Tr>
            <Tr>
              <Td>خدمة التمارين</Td>
              <Td>١٥ ريال شهريًا</Td>
            </Tr>
          </Tbody>
        </Table>
      </TableContainer>
      <Text>
        أسعار الباقات قابلة للتعديل في أي وقت ويحق لنا تعديل الباقات دون حاجة
        للحصول على موافقة العميل أو إخطاره وتطبق التعديلات على الاشتراكات
        الجديدة وتجديد الاشتراكات.
      </Text>
      <UnorderedList>
        <ListItem>
          {' '}
          قد يتم فرض رسوم أو ضرائب حكومية على قيمة الاشتراكات مثل القيمة المضافة
          أو أي التزامات مالية أخرى مثل ، وبالتالي يتحملها العميل.
        </ListItem>
        <ListItem>
          تختلف رسوم التواصل والمتابعة الخاصة عن التواصل بالمجموعات، ويلتزم
          العميل بدفع الرسوم وقيمة الاشتراك المقررة لنظام التواصل الذي يختاره.
        </ListItem>
        <ListItem>
          يمكنك دفع قيمة الاشتراك من خلال وسائل الدفع المتاحة لدينا والتي تشمل
          (خدمة باي بال PayPal)، ويتم تحديد قيمة الاشتراكات بالريال السعودي ويتم
          دفع قيمة الاشتراكات بالدولار الأمريكي. وقد نقوم بتحديد بعض وسائل الدفع
          لبعض العملاء أو بعض أنواع الاشتراكات.
        </ListItem>
        <ListItem>
          قد يتم فرض رسوم متعلقة بعملية تحويل قيمة الاشتراكات لنا، وهذه الرسوم
          قد يفرضها مزودي خدمات الدفع الإلكتروني أو البنوك أو الجهات مصدرة
          البطاقات ويتحمل العميل هذه الرسوم.
        </ListItem>
        <ListItem>
          {' '}
          الاشتراك في الخدمة نهائي لا رجوع فيه، وبالتالي لا يحق للعميل إلغاء
          الاشتراك أو المطالبة باسترداد المبالغ المدفوعة، فيكون الاشتراك مقابل
          الجداول والخدمات التي نرسلها للعميل.
        </ListItem>
        <ListItem>
          {' '}
          يعد الدفع من خلال وسائل الدفع التي نوفرها موافقة وقبول نهائي بالاشتراك
          في الخدمة وفق الشروط والأحكام المتوفرة في هذه الوثيقة.
        </ListItem>
        <ListItem>
          {' '}
          يحق لنا في أي وقت ولأي سبب نراه مناسبًا سحب الاشتراك وإعادة المبلغ
          المتبقي للعميل، ولا يحق للعميل المطالبة بالمبالغ مقابل أيام الاشتراك
          في هذه الحالة، فلا يحق للعميل الحصول على أي مبالغ طالما حصل على
          الاشتراك.
        </ListItem>
        <ListItem>
          {' '}
          إعادة المبالغ للعميل وفقًا لرؤيتنا يتم عبر بوابة الدفع المستخدمة في
          دفع قيمة الاشتراك أو أي وسيلة دفع أخرى تكون مناسبة للموقع.
        </ListItem>
        <ListItem>
          في حال عدم نزول الوزن أو زيادة الوزن نتيجة عدم الالتزام بالنظام أو
          تطبيقه بشكل صحيح أو أي مشكلة أخرى فهذا لا يعطي العميل الحق في المطالبة
          باسترداد مبلغ الاشتراك.
        </ListItem>
        <ListItem>
          {' '}
          يحق لنا تغيير وتعديل شروط الاشتراك الخاصة بنا في أي وقت نراه مناسبًا
          وسوف تطبق أحكام السياسة بعد التعديلات بشكل مباشر على حالات الاشتراك
          الجديدة أو حالات تجديد الاشتراك.
        </ListItem>
      </UnorderedList>
    </>
  );
}
